Catalogs/Лео_СводПодсветка/Лео_СводПодсветка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Лео_СводПодсветка</name>
  <attributes>
    <name>ОПЗС</name>
    <type>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланЦенаЦвет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактЦенаЦвет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланКоличествоЦвет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактКоличествоЦвет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Catalogs/Лео_СводПодсветка/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПланЦенаЦветПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Объект.ПланЦенаЦвет = ПланЦенаЦвет;
КонецПроцедуры

&НаКлиенте
Процедура ФактЦенаЦветПриИзменении(Элемент)
	// Вставить содержимое обработчика. 
	Объект.ФактЦенаЦвет = ФактЦенаЦвет;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
	ПланЦенаЦвет = Объект.ПланЦенаЦвет;
	ФактЦенаЦвет = Объект.ФактЦенаЦвет;
	ПланКоличествоЦвет = Объект.ПланКоличествоЦвет;
	ФактКоличествоЦвет = Объект.ФактКоличествоЦвет;
КонецПроцедуры

&НаКлиенте
Процедура ПланКоличествоЦветПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Объект.ПланКоличествоЦвет = ПланКоличествоЦвет;
КонецПроцедуры

&НаКлиенте
Процедура ФактКоличествоЦветПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Объект.ФактКоличествоЦвет = ФактКоличествоЦвет;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Вставить содержимое обработчика 
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) тогда
		 Объект.Наименование = СокрЛП(Объект.Номенклатура);
	КонецЕсли;	
КонецПроцедуры
